# 1트, 1시간 좀 넘게 걸려서 성공
# 익숙하다고 생각했는데 델타 탐색이 아직 서툴렀음 이걸 빨리, 바로 해내도록 하자
세로, 가로 = map(int, input().split())
얼음틀 = [list([0] * 가로) for _ in range(세로)]
# print(얼음틀)  # 빈 얼음틀

for i in range(세로):
    한줄 = input()
    for j in range(가로):
        얼음틀[i][j] = int(한줄[j])

# print(얼음틀)  # 음료수를 부은 얼음틀

# 에너미 컨트롤러
dr = [-1, 0, 1, 0]
dc = [0, 1, 0, -1]  # 상우하좌


def dfs(row, col):
    얼음틀[row][col] = 1  # 방문체크
    for i in range(len(dr)):
        nr = row + dr[i]
        nc = col + dc[i]
        if nr >= 0 and nr < 세로 and nc >= 0 and nc < 가로 and 얼음틀[nr][nc] == 0:
            dfs(nr, nc)


ans = 0
for i in range(세로):
    for j in range(가로):
        if 얼음틀[i][j] == 0:
            dfs(i, j)
            ans += 1
            print(얼음틀)

print(ans)

# input
"""
4 5
00110
00011
11111
00000
"""
"""
15 14
00000111100000
11111101111110
11011101101110
11011101100000
11011111111111
11011111111100
11000000011111
01111111111111
00000000011111
01111111111000
00011111111000
00000001111000
11111111110011
11100011111111
11100011111111
"""
